Module | Success | ![#c5f015](https://placehold.it/15/c5f015/000000?text=+) Add | Change | Destroy
--- | --- | ---: | ---: | ---:
**cloudflare** | ![#c5f015](https://placehold.it/15/c5f015/000000?text=+) `True` | 0 | 0 | 0
**github** | ![#c5f015](https://placehold.it/15/c5f015/000000?text=+) `True` | **3** | 0 | 0
**management_app** | ![#c5f015](https://placehold.it/15/c5f015/000000?text=+) `True` | 0 | 0 | 0
**prod/web_app** | ![#c5f015](https://placehold.it/15/c5f015/000000?text=+) `True` | 0 | 0 | 0
**stage/web_app** | ![#c5f015](https://placehold.it/15/c5f015/000000?text=+) `True` | 0 | 0 | 0

# **cloudflare**

## stdout

```make[1]: Entering directory '/home/travis/build/twindb/infra/terraform/cloudflare'
terraform init -no-color

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "cloudflare" (terraform-providers/cloudflare) 1.18.1...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform get -update=true -no-color
terraform plan -var-file=../global_variables.tfvars -var-file=/dev/null -input=false -no-color
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
make[1]: Leaving directory '/home/travis/build/twindb/infra/terraform/cloudflare'
```

## stderr

_no output_

# **github**

## stdout

```make[1]: Entering directory '/home/travis/build/twindb/infra/terraform/github'
terraform init -no-color
Initializing modules...
- backup in ../modules/twindb-gitflow-repo
- dd-agent in ../modules/twindb-github-repo
- infra in ../modules/twindb-github-repo
- mydumper in ../modules/twindb-github-repo
- omnibus-centos in ../modules/twindb-github-repo
- omnibus-debian in ../modules/twindb-github-repo
- omnibus-software in ../modules/twindb-github-repo
- omnibus-ubuntu in ../modules/twindb-github-repo
- proxysql-tools in ../modules/twindb-gitflow-repo
- pyetcd in ../modules/twindb-gitflow-repo
- terraform-ci in ../modules/twindb-github-repo_2
- terraform-twindb-github-repo in ../modules/twindb-github-repo
- twindb-table-compare in ../modules/twindb-gitflow-repo
- twindb-terraform-modules in ../modules/twindb-github-repo
- twindb-xtrabackup-80 in ../modules/twindb-github-repo
- twindb_cloudflare in ../modules/twindb-gitflow-repo
- twindb_infrastructure in ../modules/twindb-gitflow-repo
- undrop-for-innodb in ../modules/twindb-gitflow-repo

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "github" (hashicorp/github) 2.2.1...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform get -update=true -no-color
- backup in ../modules/twindb-gitflow-repo
- dd-agent in ../modules/twindb-github-repo
- infra in ../modules/twindb-github-repo
- mydumper in ../modules/twindb-github-repo
- omnibus-centos in ../modules/twindb-github-repo
- omnibus-debian in ../modules/twindb-github-repo
- omnibus-software in ../modules/twindb-github-repo
- omnibus-ubuntu in ../modules/twindb-github-repo
- proxysql-tools in ../modules/twindb-gitflow-repo
- pyetcd in ../modules/twindb-gitflow-repo
- terraform-ci in ../modules/twindb-github-repo_2
- terraform-twindb-github-repo in ../modules/twindb-github-repo
- twindb-table-compare in ../modules/twindb-gitflow-repo
- twindb-terraform-modules in ../modules/twindb-github-repo
- twindb-xtrabackup-80 in ../modules/twindb-github-repo
- twindb_cloudflare in ../modules/twindb-gitflow-repo
- twindb_infrastructure in ../modules/twindb-gitflow-repo
- undrop-for-innodb in ../modules/twindb-gitflow-repo
terraform plan -var-file=../global_variables.tfvars -var-file=/dev/null -input=false -no-color
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_team.website-devs: Refreshing state... [id=2396943]
module.twindb_cloudflare.github_repository.twindb_repo: Refreshing state... [id=twindb_cloudflare]
module.terraform-twindb-github-repo.github_repository.twindb_repo: Refreshing state... [id=terraform-twindb-github-repo]
module.pyetcd.github_repository.twindb_repo: Refreshing state... [id=pyetcd]
module.twindb-terraform-modules.github_repository.twindb_repo: Refreshing state... [id=twindb-terraform-modules]
module.twindb-xtrabackup-80.github_repository.twindb_repo: Refreshing state... [id=twindb-xtrabackup-80]
module.twindb_infrastructure.github_repository.twindb_repo: Refreshing state... [id=twindb_infrastructure]
module.proxysql-tools.github_repository.twindb_repo: Refreshing state... [id=proxysql-tools]
module.infra.github_repository.twindb_repo: Refreshing state... [id=infra]
module.omnibus-ubuntu.github_repository.twindb_repo: Refreshing state... [id=omnibus-ubuntu]
module.omnibus-centos.github_repository.twindb_repo: Refreshing state... [id=omnibus-centos]
module.undrop-for-innodb.github_repository.twindb_repo: Refreshing state... [id=undrop-for-innodb]
module.dd-agent.github_repository.twindb_repo: Refreshing state... [id=dd-agent]
module.twindb-table-compare.github_repository.twindb_repo: Refreshing state... [id=twindb-table-compare]
module.mydumper.github_repository.twindb_repo: Refreshing state... [id=mydumper]
module.omnibus-software.github_repository.twindb_repo: Refreshing state... [id=omnibus-software]
module.backup.github_repository.twindb_repo: Refreshing state... [id=backup]
github_user_gpg_key.aleks_twindb: Refreshing state... [id=496571]
github_user_ssh_key.aleks_at_Aleksandrs-MBP: Refreshing state... [id=32423513]
github_user_ssh_key.aleks_at_secondary: Refreshing state... [id=35202406]
github_user_gpg_key.aleks_personal: Refreshing state... [id=496569]
github_team.website-admins: Refreshing state... [id=2427273]
github_user_ssh_key.deployer: Refreshing state... [id=37238766]
github_membership.membership_for_mkryva: Refreshing state... [id=twindb:mkryva]
module.omnibus-debian.github_repository.twindb_repo: Refreshing state... [id=omnibus-debian]
github_membership.membership_for_aleks: Refreshing state... [id=twindb:akuzminsky]
github_team_membership.website-devs-mkryva: Refreshing state... [id=2396943:mkryva]
github_team_membership.website-devs-akuzminsky: Refreshing state... [id=2396943:akuzminsky]
module.twindb_cloudflare.github_branch_protection.release_branch[0]: Refreshing state... [id=twindb_cloudflare:master]
module.twindb_cloudflare.github_repository_webhook.travis-ci[0]: Refreshing state... [id=103661339]
module.twindb_cloudflare.github_repository_webhook.slack: Refreshing state... [id=103656107]
module.twindb_cloudflare.github_branch_protection.default_branch[0]: Refreshing state... [id=twindb_cloudflare:develop]
module.pyetcd.github_repository_webhook.slack: Refreshing state... [id=103656070]
module.pyetcd.github_branch_protection.release_branch[0]: Refreshing state... [id=pyetcd:master]
module.pyetcd.github_branch_protection.default_branch[0]: Refreshing state... [id=pyetcd:develop]
module.pyetcd.github_repository_webhook.travis-ci[0]: Refreshing state... [id=103661342]
module.terraform-twindb-github-repo.github_repository_webhook.slack: Refreshing state... [id=118464933]
module.terraform-twindb-github-repo.github_branch_protection.default_branch[0]: Refreshing state... [id=terraform-twindb-github-repo:master]
module.twindb-terraform-modules.github_repository_webhook.slack: Refreshing state... [id=103784007]
module.twindb-terraform-modules.github_branch_protection.default_branch[0]: Refreshing state... [id=twindb-terraform-modules:master]
module.twindb_infrastructure.github_repository_webhook.travis-ci[0]: Refreshing state... [id=103661352]
module.twindb_infrastructure.github_branch_protection.release_branch[0]: Refreshing state... [id=twindb_infrastructure:master]
module.twindb_infrastructure.github_branch_protection.default_branch[0]: Refreshing state... [id=twindb_infrastructure:develop]
module.twindb_infrastructure.github_repository_webhook.slack: Refreshing state... [id=103656187]
module.twindb-xtrabackup-80.github_branch_protection.default_branch[0]: Refreshing state... [id=twindb-xtrabackup-80:master]
module.twindb-xtrabackup-80.github_repository_webhook.slack: Refreshing state... [id=116684961]
module.omnibus-ubuntu.github_repository_webhook.registry_docker_hub[0]: Refreshing state... [id=103656089]
module.omnibus-ubuntu.github_repository_webhook.slack: Refreshing state... [id=103656209]
module.omnibus-ubuntu.github_repository_webhook.cloud_docker_hub[0]: Refreshing state... [id=103656175]
module.proxysql-tools.github_repository_webhook.slack: Refreshing state... [id=103656122]
module.proxysql-tools.github_repository_webhook.travis-ci[0]: Refreshing state... [id=103661348]
module.proxysql-tools.github_branch_protection.release_branch[0]: Refreshing state... [id=proxysql-tools:master]
module.proxysql-tools.github_branch_protection.default_branch[0]: Refreshing state... [id=proxysql-tools:develop]
module.infra.github_repository_webhook.slack: Refreshing state... [id=110993178]
module.infra.github_branch_protection.default_branch[0]: Refreshing state... [id=infra:master]
module.infra.github_repository_webhook.travis-ci[0]: Refreshing state... [id=110993187]
module.omnibus-centos.github_repository_webhook.slack: Refreshing state... [id=103656144]
module.omnibus-centos.github_repository_webhook.registry_docker_hub[0]: Refreshing state... [id=103656130]
module.omnibus-centos.github_repository_webhook.cloud_docker_hub[0]: Refreshing state... [id=103656079]
module.undrop-for-innodb.github_repository_webhook.slack: Refreshing state... [id=103656136]
module.undrop-for-innodb.github_branch_protection.release_branch[0]: Refreshing state... [id=undrop-for-innodb:master]
module.undrop-for-innodb.github_branch_protection.default_branch[0]: Refreshing state... [id=undrop-for-innodb:develop]
module.dd-agent.github_repository_webhook.slack: Refreshing state... [id=103656204]
module.dd-agent.github_branch_protection.default_branch[0]: Refreshing state... [id=dd-agent:master]
module.twindb-table-compare.github_branch_protection.release_branch[0]: Refreshing state... [id=twindb-table-compare:master]
module.twindb-table-compare.github_repository_webhook.travis-ci[0]: Refreshing state... [id=103661355]
module.twindb-table-compare.github_repository_webhook.slack: Refreshing state... [id=103656258]
module.twindb-table-compare.github_repository_webhook.rtd[0]: Refreshing state... [id=103656162]
module.twindb-table-compare.github_branch_protection.default_branch[0]: Refreshing state... [id=twindb-table-compare:develop]
module.mydumper.github_branch_protection.default_branch[0]: Refreshing state... [id=mydumper:master]
module.mydumper.github_repository_webhook.slack: Refreshing state... [id=103656155]
module.omnibus-software.github_branch_protection.default_branch[0]: Refreshing state... [id=omnibus-software:master]
module.omnibus-software.github_repository_webhook.slack: Refreshing state... [id=103656251]
module.backup.github_repository_webhook.slack: Refreshing state... [id=103656253]
module.backup.github_repository_webhook.travis-ci[0]: Refreshing state... [id=103656182]
module.backup.github_branch_protection.default_branch[0]: Refreshing state... [id=backup:develop]
module.backup.github_repository_webhook.rtd[0]: Refreshing state... [id=103656248]
module.backup.github_branch_protection.release_branch[0]: Refreshing state... [id=backup:master]
github_team_membership.akuzminsky: Refreshing state... [id=2427273:akuzminsky]
module.omnibus-debian.github_repository_webhook.slack: Refreshing state... [id=103656194]
module.omnibus-debian.github_repository_webhook.registry_docker_hub[0]: Refreshing state... [id=103656084]
module.omnibus-debian.github_repository_webhook.cloud_docker_hub[0]: Refreshing state... [id=103656226]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.terraform-ci.github_branch_protection.default_branch[0] will be created
  + resource "github_branch_protection" "default_branch" {
      + branch                 = "master"
      + enforce_admins         = true
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "terraform-ci"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "Travis CI - Branch",
              + "Travis CI - Pull Request",
            ]
          + strict   = true
        }
    }

  # module.terraform-ci.github_repository.twindb_repo will be created
  + resource "github_repository" "twindb_repo" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + auto_init          = true
      + default_branch     = (known after apply)
      + description        = "Helper tool to merry Terraform and Travis-CI"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_downloads      = false
      + has_issues         = true
      + homepage_url       = "https://twindb.com"
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "terraform-ci"
      + private            = false
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # module.terraform-ci.github_repository_webhook.slack will be created
  + resource "github_repository_webhook" "slack" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "*",
        ]
      + id         = (known after apply)
      + repository = "terraform-ci"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = "false"
          + url          = "https://hooks.slack.com/services/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"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

make[1]: Leaving directory '/home/travis/build/twindb/infra/terraform/github'
```

## stderr

_no output_

# **management_app**

## stdout

```make[1]: Entering directory '/home/travis/build/twindb/infra/terraform/management_app'
terraform init -no-color

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "cloudflare" (terraform-providers/cloudflare) 1.18.1...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.26.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform get -update=true -no-color
terraform plan -var-file=../global_variables.tfvars -var-file=configuration.tfvars -input=false -no-color
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_s3_bucket.twindb-release: Refreshing state... [id=twindb-release]
aws_s3_bucket.twindb-terraform-states: Refreshing state... [id=twindb-terraform-states]
aws_s3_bucket.omnibus-cache-twindb-backup: Refreshing state... [id=omnibus-cache-twindb-backup]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
make[1]: Leaving directory '/home/travis/build/twindb/infra/terraform/management_app'
```

## stderr

_no output_

# **prod/web_app**

## stdout

```make[1]: Entering directory '/home/travis/build/twindb/infra/terraform/prod/web_app'
terraform init -no-color

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "cloudflare" (terraform-providers/cloudflare) 1.18.1...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.26.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform get -update=true -no-color
terraform plan -var-file=../../global_variables.tfvars -var-file=configuration.tfvars -input=false -no-color
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
make[1]: Leaving directory '/home/travis/build/twindb/infra/terraform/prod/web_app'
```

## stderr

_no output_

# **stage/web_app**

## stdout

```make[1]: Entering directory '/home/travis/build/twindb/infra/terraform/stage/web_app'
terraform init -no-color

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "cloudflare" (terraform-providers/cloudflare) 1.18.1...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.26.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform get -update=true -no-color
terraform plan -var-file=../../global_variables.tfvars -var-file=configuration.tfvars -input=false -no-color
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_s3_bucket.website_database_archive: Refreshing state... [id=twindb-website-database-staging-archive]
aws_s3_bucket.website_uploads_archive: Refreshing state... [id=twindb-website-uploads-staging-archive]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
make[1]: Leaving directory '/home/travis/build/twindb/infra/terraform/stage/web_app'
```

## stderr

_no output_
